app/controllers/movies_controller.rb

  def index
    @all_ratings = Movie.ratings
    if params[:ratings] == nil
      @movies = Movie.order(params[:sort])
    else
      @select_ratings = params[:ratings]
      @movies = Movie.where(["rating IN (?)", @select_ratings.keys]).order(params[:sort])
---
SELECT "movies".* FROM "movies" WHERE (rating IN ('G','PG'))
SELECT "movies".* FROM "movies" WHERE (rating = ["G"])